0.0 Cleaning Data Efficiently

Cleaning data by chaining instead of single line code is visually simpler and easier to follow. Below is an example of this (noted as #effcient cleaning example) and is how I will do future cleans on data bases. Unfortunatley, this project was done prior to this method.

The second part shows one way on how to generate unique colums only from a data frame. While it was not needed in the data frame used, I have put it in here for my own refrence.

# Import

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
df = pd.read_csv ('/Users/christinarandall/Documents/Career Foundry Projects/Achievment 4/Data/Orginal Data/customers.csv')

In [3]:
df.head(3)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568

In [4]:
df.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

# Cleaning the data

In [5]:
#effcient cleaning example
cleaned_df = (df
              .rename(columns=lambda c: c.replace(' ', '_'))
              .rename(columns=str.lower)
              .rename(columns={'surnam': 'last_name', 'fam_status': 'martial_status'})
              .assign(user_id=lambda df_: df_['user_id'].astype('int64'),
                      n_dependants=lambda df_: df_['n_dependants'].astype('int8'),
                      age=lambda df_: df_['age'].astype('int8'),
                      income=lambda df_: df_['income'].astype('int64'),
                      first_name=lambda df_: df_['first_name'].astype(str),
                      last_name=lambda df_: df_['last_name'].astype(str),
                      gender=lambda df_: df_['gender'].astype(str),
                      state=lambda df_: df_['state'].astype(str),
                      martial_status=lambda df_: df_['martial_status'].astype(str))
              .assign(date_joined=pd.to_datetime(df['date_joined']))
             )

In [6]:
cleaned_df.head(10)

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,martial_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,2017-01-01,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,2017-01-01,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,2017-01-01,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,2017-01-01,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,2017-01-01,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,2017-01-01,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,2017-01-01,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,2017-01-01,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,2017-01-01,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,2017-01-01,2,married,32072

In [7]:
cleaned_df.dtypes

user_id                    int64
first_name                object
last_name                 object
gender                    object
state                     object
age                         int8
date_joined       datetime64[ns]
n_dependants                int8
martial_status            object
income                     int64
dtype: object

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [9]:
#by cleaning and storing df correctly we saved 2.7 MB of memory. Now think of this on a larger scale.
cleaned_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  int64
 1   first_name      206209 non-null  object
 2   last_name       206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  int8
 6   date_joined     206209 non-null  datetime64[ns]
 7   n_dependants    206209 non-null  int8
 8   martial_status  206209 non-null  object
 9   income          206209 non-null  int64
dtypes: datetime64[ns](1), int64(2), int8(2), object(5)
memory usage: 13.0+ MB

# Getting Unique Columns Only based on '.'

In [10]:
#unique colums only
def get_uniq_cols(df):
    counter = collections.defaultdict(list)
    for col in sorted (df.columns):
        period_count = col.count('.')
        if period_count >= 2:
            part_end = 2
        else:
            part_end = 1 
        parts = col.split('.')[:part_end]
        counter['.'.join(parts)].append(col)
    uniq_cols = []
    for cols in counter.values():
        if len(cols) == 1:
            uniq_cols.extend(cols)
    return uniq_cols

In [11]:
#example of unique colums only
import pandas as pd
import collections

# Example data frame
data = {
    'Column1': [1, 2, 3, 4, 5],
    'Column2': ['A', 'B', 'C', 'D', 'E'],
    'Column3': [True, False, True, False, True],
    'Column4.Subcolumn1': [0.1, 0.2, 0.3, 0.4, 0.5],
    'Column4.Subcolumn2': ['X', 'Y', 'Z', 'X', 'Y'],
    'Column5': ['Hello', 'World', 'Data', 'Frame', 'Example']
}

df = pd.DataFrame(data)

print(df)

   Column1 Column2  Column3  Column4.Subcolumn1 Column4.Subcolumn2  Column5
0        1       A     True                 0.1                  X    Hello
1        2       B    False                 0.2                  Y    World
2        3       C     True                 0.3                  Z     Data
3        4       D    False                 0.4                  X    Frame
4        5       E     True                 0.5                  Y  Example

In [12]:
#note how their is no column4; it has been dropped
uniq_cols = get_uniq_cols(df)
print(uniq_cols)

['Column1', 'Column2', 'Column3', 'Column5']